{
  "개요": "Overview",
  "기본 사용법": "Basic Usage",
  "기존 Sheets 데이터 완전 대체": "Complete replacement of existing Sheets data",
  "는 로컬의 번역 JSON 파일들을 Google Sheets로 업로드하는 CLI 도구입니다. 팀원들과 번역 작업을 협업하기 위한 첫 단계입니다.": "is a CLI tool that uploads local translation JSON files to Google Sheets. It's the first step for collaborating on translations with your team.",
  "다음 단계": "Next Steps",
  "데이터 덮어쓰기": "Data Overwrite",
  "데이터 변환": "Data Conversion",
  "로컬 번역 파일을 Google Sheets로 업로드합니다": "Upload local translation files to Google Sheets",
  "로컬 번역 파일이 최신 상태인지 확인 후 업로드하세요.": "Make sure your local translation files are up to date before uploading.",
  "로컬 파일 읽기": "Read Local Files",
  "명령어 옵션": "Command Options",
  "명령줄 옵션 사용": "Using Command Line Options",
  "모든 언어 파일을 한 번에 업로드": "Upload all language files at once",
  "모범 사례": "Best Practices",
  "문자열": "String",
  "번역 파일 디렉토리 (기본값: \"./locales\")": "Translation file directory (default: \"./locales\")",
  "설정": "Settings",
  "설정 파일 사용": "Using Configuration File",
  "업로드 완료 메시지와 함께 통계를 표시합니다.": "Displays statistics along with upload completion message.",
  "업로드 전 확인": "Verify Before Upload",
  "업로드 프로세스": "Upload Process",
  "업로드 후 Sheets URL을 팀원들과 공유하여 함께 번역 작업을 시작하세요.": "After uploading, share the Sheets URL with your team to start translation work together.",
  "업로드할 시트 이름 (기본값: \"Translations\")": "Sheet name to upload to (default: \"Translations\")",
  "예제 출력": "Example Output",
  "완료": "Complete",
  "이후에는 i18n-download를 사용하여 Sheets에서 번역을 가져옵니다": "Afterwards, use i18n-download to fetch translations from Sheets",
  "일반적으로 프로젝트 초기 설정 시 한 번만 사용합니다": "Typically used only once during initial project setup",
  "자동으로 Sheets 포맷 생성": "Automatically generate Sheets format",
  "주의사항": "Warnings",
  "초기 설정에만 사용": "Use Only for Initial Setup",
  "팀원과 공유": "Share with Team",
  "프로젝트 시작 시 한 번만 업로드하고, 이후에는 Sheets에서 번역 작업을 진행하세요.": "Upload only once at project start, then proceed with translation work in Sheets.",
  "홈": "Home",
  "Google Cloud 서비스 계정 인증 정보 JSON 파일 경로 (필수)": "Google Cloud service account credentials JSON file path (required)",
  "Google Sheets 초기 설정 가이드 보기": "View Google Sheets Initial Setup Guide",
  "Google Sheets의 기존 데이터를 지우고 새 데이터로 완전히 대체합니다.": "Completely replaces existing data in Google Sheets with new data.",
  "Google Sheets의 Spreadsheet ID (필수)": "Google Sheets Spreadsheet ID (required)",
  "i18n-upload는 Google Sheets의 기존 데이터를 완전히 삭제하고 새 데이터로 대체합니다": "i18n-upload completely deletes existing data in Google Sheets and replaces it with new data",
  "i18nexus-tools": "i18nexus-tools",
  "i18nexus.config.json에 Google Sheets 정보가 설정되어 있다면:": "If Google Sheets information is configured in i18nexus.config.json:",
  "JSON 데이터를 Google Sheets 형식으로 변환합니다. 첫 행은 언어 코드, 첫 열은 번역 키가 됩니다.": "Converts JSON data to Google Sheets format. The first row contains language codes, and the first column contains translation keys.",
  "locales 디렉토리의 모든 JSON 파일을 읽어옵니다.": "Reads all JSON files in the locales directory.",
  "Sheets 업데이트": "Update Sheets",
  "Sheets URL에서 확인: https://docs.google.com/spreadsheets/d/[SPREADSHEET_ID]/edit": "Check in Sheets URL: https://docs.google.com/spreadsheets/d/[SPREADSHEET_ID]/edit",
  "Sheets에서 번역을 안전하게 다운로드하는 방법": "How to safely download translations from Sheets",
  "Sheets에서 직접 수정한 번역이 있다면 먼저 백업하세요": "If you have translations modified directly in Sheets, back them up first"
}